app/controllers/attrs_controller.rb

  def show
    @attr = Attr.find(params[:id])
---
SELECT * FROM `attrs` WHERE (`attrs`.`id` = 1)

  def create
    @attr = Attr.new(params[:attr])

    if params[:config_class] =~ /\W/
      @attr.errors.add("attr_configuration", "class name contains invalid characters.")
      render :action => "new"
      return
    end
    if params[:config_class].nil?
      @attr.errors.add("attr_configuration", "class name must be specified.")
      render :action => "new"
      return
    end
    config_class = eval(params[:config_class])

    @attr.attr_configuration = config_class.new(params[:attr].reject {|k, v| k == 'name'})
    @attr.structure_template = @structure_template

    respond_to do |format|
      if @attr.save
---
INSERT INTO `attrs` (`name`, `attr_configuration_id`, `structure_template_id`, `position`, `required`, `attr_configuration_type`) VALUES('test', 2, 1, 2, NULL, 'TextField')

  def update
    @attr = Attr.find(params[:id])

    respond_to do |format|
      if @attr.update_attributes(params[:attr])
---
SELECT * FROM `attrs` WHERE (`attrs`.`id` = 1)
UPDATE `attrs` SET `name` = 'SomethingElse' WHERE `id` = 1

  def destroy
    @attr = Attr.find(params[:id])
    @attr.destroy
---
SELECT * FROM `attrs` WHERE (`attrs`.`id` = 1)
DELETE FROM `attrs` WHERE `id` = 1