app/controllers/documents_controller.rb

  def show
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)

  def edit
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)

  def update
    @document = Document.find(params[:id])
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
DELETE FROM `documents` WHERE `id` = 1