app/controllers/projects_controller.rb

SELECT * FROM `projects` LIMIT 1
---
  def create
    unless params[:project][:template_source_project_id].blank?