app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id],
      :include => { :docs => { :doc_template => [] },
                               :permissions => [] })
---
SELECT * FROM `permissions` WHERE (`permissions`.person_id = 2)
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`name`, `template_schema_id`) VALUES(NULL, 1)

  def update
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)

  def destroy
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)