app/controllers/structures_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def create
    @structure = Structure.new(params[:structure])
    @structure.structure_template = StructureTemplate.find(params[:template_id])
    @structure.project = @project

    struct_ok = @structure.save
    @attr_errors = {}

    if struct_ok
      params[:attrs].each do |id, value|
        val = @structure.attr_value(Attr.find(id))