app/controllers/structure_templates_controller.rb

  def show
    @structure_template = StructureTemplate.find(params[:id])
---
SELECT * FROM `structure_templates` WHERE (`structure_templates`.`id` = 1)

  def create
    @structure_template = StructureTemplate.new(params[:structure_template])
    @structure_template.template_schema = @template_schema

    respond_to do |format|
      if @structure_template.save
---
INSERT INTO `structure_templates` (`name`, `template_schema_id`, `parent_id`) VALUES(NULL, 1, NULL)

  def update
    @structure_template = StructureTemplate.find(params[:id])
---
SELECT * FROM `structure_templates` WHERE (`structure_templates`.`id` = 1)

  def destroy
    @structure_template = StructureTemplate.find(params[:id])
    @structure_template.destroy
---
SELECT * FROM `structure_templates` WHERE (`structure_templates`.parent_id = 1)
DELETE FROM `structure_templates` WHERE `id` = 2