app/controllers/template_schemas_controller.rb

SELECT * FROM `template_schemas` WHERE (`template_schemas`.`id` = 1)
---
  def show
    @template_schema = TemplateSchema.find(params[:id])

INSERT INTO `template_schemas` (`name`, `description`) VALUES(NULL, NULL)
---
  def create
    @template_schema = TemplateSchema.new(params[:template_schema])

    respond_to do |format|
      if @template_schema.save

SELECT * FROM `template_schemas` WHERE (`template_schemas`.`id` = 1)
---
  def update
    @template_schema = TemplateSchema.find(params[:id])

SELECT * FROM `template_schemas` WHERE (`template_schemas`.`id` = 1)
DELETE FROM `template_schemas` WHERE `id` = 1
---
  def destroy
    @template_schema = TemplateSchema.find(params[:id])
    @template_schema.destroy